app/controllers/movies_controller.rb

  def index
    if params[:category].blank?
      @movies = Movie.all
---
SELECT "categories".* FROM "categories"
SELECT "movies".* FROM "movies"

  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("title", "teaser", "rating", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @movie.update(movie_params)
---
UPDATE "movies" SET "description" = ?, "updated_at" = ? WHERE "movies"."id" = ?