app/views/layouts/application.html.erb

            <li><%= link_to 'All Categories', root_path %></li>
            <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"